app/controllers/api/api_controller.rb

  def all
    #vil = Vil.all
    #rajout des images generiques
    vil = PpCity.all.where(country_id: 37)
---
SELECT `pp_city`.* FROM `pp_city` WHERE `pp_city`.`country_id` = 37

  def proximity
  	curentDate = Time.now

    #creation d'un tableau
    marketContainer = Array.new

  	#recherche de tous les calendrier
  	#caldav = Market.where("debut >= '#{curentDate}'").all

    #me retourne les dates de debut et de fin, mais egalemennt les IDs des differents marchés
    caldav = PpProgram.where("date_deb <= '#{curentDate}' ").limit(7)

    #recherche des noms des marchés concernés
    caldav.each do |m|
      result = PpMarche.find_by_marche_id(m.marche_id)
---
SELECT  `pp_program`.* FROM `pp_program` WHERE (date_deb <= '2018-06-04 17:54:54 +0200' ) LIMIT 7
SELECT  `pp_marche`.* FROM `pp_marche` WHERE `pp_marche`.`marche_id` = 2 LIMIT 1

  def getMarche
  	#on change le quarier pour la ville
  	#quartier = params[:id]
  	ville = params[:id]
  	#render json: Market.where(quartier_id: quartier)
  	render json: PpMarche.where(city_id: ville)
---
SELECT `pp_marche`.* FROM `pp_marche` WHERE `pp_marche`.`city_id` = 4240

  def getProduit
    marche = params[:id]
    render json: Produit.where(market_id: marche)
---
SELECT `produits`.* FROM `produits` WHERE `produits`.`market_id` = 0